<a href="https://colab.research.google.com/github/Dwayne-tech/DML/blob/main/Dwayne_RDBM.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql
%sql sqlite://

In [ ]:
%%sql
CREATE TABLE Wine (
  WineID INT PRIMARY KEY,
  Color VARCHAR(10),
  Year INT,
  Degree FLOAT,
  ProducerID INT,
  FOREIGN KEY (ProducerID) REFERENCES Producer(ProducerID)
);

In [ ]:
%%sql
CREATE TABLE Producer (
  ProducerID INT PRIMARY KEY,
  FirstName VARCHAR(10),
  LastName VARCHAR(10),
  City VARCHAR(20)
);

In [ ]:
%%sql
INSERT INTO Wine(WineID, Color, Year, Degree) VALUES
(1, 'Red', 2019, 13.5),
(2, 'White', 2020, 12.0),
(3, 'Rose', 2018, 11.5),
(4, 'Red', 2021, 14.0),
(5, 'Sparkling', 2017, 10.5),
(6, 'White', 2019, 12.5),
(7, 'Red', 2022, 13.0),
(8, 'Rose', 2020, 11.0),
(9, 'Red', 2018, 12.0),
(10, 'Sparkling', 2019, 10.0),
(11, 'White', 2021, 11.5),
(12, 'Red', 2022, 15.0);

In [ ]:
%%sql
Select * from wine;

In [ ]:
%%sql
INSERT INTO Producer (ProducerID, FirstName, LastName, City) VALUES
(1, 'John', 'Smith', 'Sousse'),
(2, 'Emma', 'Johnson', 'Tunis'),
(3, 'Michael', 'Williams', 'Sfax'),
(4, 'Emily', 'Brown', 'Sousse'),
(5, 'James', 'Jones', 'Sousse'),
(6, 'Sarah', 'Davis', 'Tunis'),
(7, 'David', 'Miller', 'Sfax'),
(8, 'Olivia', 'Wilson', 'Monastir'),
(9, 'Daniel', 'Moore', 'Sousse'),
(10, 'Sophia', 'Taylor', 'Tunis'),
(11, 'Matthew', 'Anderson', 'Sfax'),
(12, 'Amelia', 'Thomas', 'Sousse');

In [ ]:
%%sql
SELECT * FROM Producer;

 * sqlite://
Done.

[(1, 'John', 'Smith', 'Sousse'),
 (2, 'Emma', 'Johnson', 'Tunis'),
 (3, 'Michael', 'Williams', 'Sfax'),
 (4, 'Emily', 'Brown', 'Sousse'),
 (5, 'James', 'Jones', 'Sousse'),
 (6, 'Sarah', 'Davis', 'Tunis'),
 (7, 'David', 'Miller', 'Sfax'),
 (8, 'Olivia', 'Wilson', 'Monastir'),
 (9, 'Daniel', 'Moore', 'Sousse'),
 (10, 'Sophia', 'Taylor', 'Tunis'),
 (11, 'Matthew', 'Anderson', 'Sfax'),
 (12, 'Amelia', 'Thomas', 'Sousse')]

In [ ]:
%%sql
SELECT * FROM Producer
ORDER BY LastName, FirstName;

 * sqlite://
Done.

[(11, 'Matthew', 'Anderson', 'Sfax'),
 (4, 'Emily', 'Brown', 'Sousse'),
 (6, 'Sarah', 'Davis', 'Tunis'),
 (2, 'Emma', 'Johnson', 'Tunis'),
 (5, 'James', 'Jones', 'Sousse'),
 (7, 'David', 'Miller', 'Sfax'),
 (9, 'Daniel', 'Moore', 'Sousse'),
 (1, 'John', 'Smith', 'Sousse'),
 (10, 'Sophia', 'Taylor', 'Tunis'),
 (12, 'Amelia', 'Thomas', 'Sousse'),
 (3, 'Michael', 'Williams', 'Sfax'),
 (8, 'Olivia', 'Wilson', 'Monastir')]

In [ ]:
%%sql
SELECT * FROM Producer WHERE City = 'Sousse';

 * sqlite://
Done.

[(1, 'John', 'Smith', 'Sousse'),
 (4, 'Emily', 'Brown', 'Sousse'),
 (5, 'James', 'Jones', 'Sousse'),
 (9, 'Daniel', 'Moore', 'Sousse'),
 (12, 'Amelia', 'Thomas', 'Sousse')]

In [ ]:
%%sql
SELECT * FROM Wine
WHERE WineID = 12;

 * sqlite://
Done.

[(12, 'Red', 2022, 15.0, None)]

In [ ]:
%%sql
SELECT Color, SUM(Degree) AS TotalDegree
FROM Wine
GROUP BY Color;

 * sqlite://
Done.

[('Red', 67.5), ('Rose', 22.5), ('Sparkling', 20.5), ('White', 36.0)]

In [ ]:
%%sql
SELECT FirstName, LastName
FROM Producer
JOIN Wine ON Producer.ProducerID = Wine.ProducerID
WHERE Producer.City = 'Sousse' AND Wine.Degree > 300
GROUP BY FirstName, LastName
HAVING COUNT(Wine.WineID) > 0;

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT WineID
FROM Wine
WHERE Degree > 12 AND ProducerID = 12;

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT FirstName, LastName
FROM Producer
WHERE ProducerID = (
  SELECT ProducerID
  FROM Wine
  GROUP BY ProducerID
  ORDER BY SUM(Degree) DESC
  LIMIT 1
);

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT AVG(Degree) AS AverageDegree
FROM Wine;

 * sqlite://
Done.

[(12.208333333333334,)]

In [ ]:
%%sql

SELECT * FROM Wine
ORDER BY Year ASC
LIMIT 1;

 * sqlite://
Done.

[(5, 'Sparkling', 2017, 10.5, None)]

In [ ]:
%%sql
SELECT FirstName, LastName, SUM(Degree) AS TotalDegree
FROM Producer
JOIN Wine ON Producer.ProducerID = Wine.ProducerID
GROUP BY FirstName, LastName;

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT Wine.WineID, Wine.Color, Wine.Year, Wine.Degree, Producer.FirstName, Producer.LastName, Producer.City
FROM Wine
JOIN Producer ON Wine.ProducerID = Producer.ProducerID;

 * sqlite://
Done.

[]